In [15]:
import pandas as pd

cars = pd.read_csv('../data_set/train-data.csv', index_col=0)

cars.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

**Importante**: Non convertire la valuta!!! (se no Pippo ti ammazza)

In [17]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6019 entries, 0 to 6018
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               6019 non-null   object
 1   Location           6019 non-null   object
 2   Year               6019 non-null   int64
 3   Kilometers_Driven  6019 non-null   int64
 4   Fuel_Type          6019 non-null   object
 5   Transmission       6019 non-null   object
 6   Owner_Type         6019 non-null   object
 7   Mileage            6017 non-null   object
 8   Engine             5983 non-null   object
 9   Power              5983 non-null   object
 10  Seats              5977 non-null   float64
 11  New_Price          824 non-null    object
 12  Price              6019 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 658.3+ KB

In [16]:
cars['Name'].value_counts()

Name
Mahindra XUV500 W8 2WD                     49
Maruti Swift VDI                           45
Maruti Swift Dzire VDI                     34
Honda City 1.5 S MT                        34
Maruti Swift VDI BSIV                      31
                                           ..
Tata New Safari EX 4x2                      1
Nissan Terrano XL Plus ICC WT20 SE          1
Honda Brio 1.2 S Option MT                  1
Volkswagen Vento Konekt Diesel Highline     1
Lamborghini Gallardo Coupe                  1
Name: count, Length: 1876, dtype: int64

In [19]:
cars['Seats'].value_counts()

Seats
5.0     5014
7.0      674
8.0      134
4.0       99
6.0       31
2.0       16
10.0       5
9.0        3
0.0        1
Name: count, dtype: int64

In [ ]:
ten_seats = cars[cars['Seats'] == 10.0]

ten_seats.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
814,Toyota Qualis FS B2,Pune,2004,77757,Diesel,Manual,Second,13.1 kmpl,2446 CC,75 bhp,10.0,NaN,3.50
917,Tata Sumo DX,Mumbai,2013,20000,Diesel,Manual,First,14.07 kmpl,1978 CC,83.1 bhp,10.0,NaN,5.25
1907,Toyota Qualis FS B3,Bangalore,2002,63000,Diesel,Manual,Third,13.1 kmpl,2446 CC,75 bhp,10.0,NaN,3.65
2267,Toyota Qualis RS E2,Pune,2004,215750,Diesel,Manual,Second,0.0 kmpl,2446 CC,null bhp,10.0,NaN,3.50
2575,Chevrolet Tavera LS B3 10 Seats BSIII,Hyderabad,2015,120000,Diesel,Manual,First,14.8 kmpl,2499 CC,80 bhp,10.0,NaN,5.50

In [22]:
cars['Year'].info()

<class 'pandas.core.series.Series'>
Index: 6019 entries, 0 to 6018
Series name: Year
Non-Null Count  Dtype
--------------  -----
6019 non-null   int64
dtypes: int64(1)
memory usage: 94.0 KB

Possiamo fare inferenza per le macchine di cui non abbiao valori per i posti, considerando potenza, consumi, cilindrata, tipo di carburante etc...

In [24]:
cars['Location'].value_counts()

Location
Mumbai        790
Hyderabad     742
Kochi         651
Coimbatore    636
Pune          622
Delhi         554
Kolkata       535
Chennai       494
Jaipur        413
Bangalore     358
Ahmedabad     224
Name: count, dtype: int64

In [ ]:
cars['Year'].value_counts()

Year
2014    797
2015    744
2016    741
2013    649
2017    587
2012    580
2011    466
2010    342
2018    298
2009    198
2008    174
2007    125
2019    102
2006     78
2005     57
2004     31
2003     17
2002     15
2001      8
2000      4
1998      4
1999      2
Name: count, dtype: int64

In [ ]:
cars[cars['Kilometers_Driven']<1000].value_counts()

Name                        Location  Year  Kilometers_Driven  Fuel_Type  Transmission  Owner_Type  Mileage    Engine   Power      Seats  New_Price  Price
Maruti Wagon R ZXI AMT 1.2  Mumbai    2019  600                Petrol     Automatic     First       21.5 kmpl  1197 CC  81.80 bhp  5.0    6.8 Lakh   6.25     1
Name: count, dtype: int64

In [ ]:
cars['Fuel_Type'].value_counts()

Fuel_Type
Diesel      3205
Petrol      2746
CNG           56
LPG           10
Electric       2
Name: count, dtype: int64

In [55]:
cars['Engine'] = cars['Engine'].astype(str).str.split().str[0].astype(float)

cars['Engine'].value_counts().sort_index()

Engine
72.0        1
624.0      25
793.0       4
796.0     129
799.0      36
         ...
4951.0      1
5000.0      2
5204.0      1
5461.0      3
5998.0      1
Name: count, Length: 146, dtype: int64

In [57]:
anomalo = cars[cars['Engine']==72.0]
anomalo

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
4446,Mahindra E Verito D4,Chennai,2016,50000,Electric,Automatic,First,NaN,72.0,41 bhp,5.0,13.58 Lakh,13.0

C'è un outlier, un auto elettrica non può avere cilindrata, non ha senso

In [58]:
anomali = cars[cars['Fuel_Type'] == 'Electric']
anomali

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
4446,Mahindra E Verito D4,Chennai,2016,50000,Electric,Automatic,First,NaN,72.0,41 bhp,5.0,13.58 Lakh,13.00
4904,Toyota Prius 2009-2016 Z4,Mumbai,2011,44000,Electric,Automatic,First,NaN,1798.0,73 bhp,5.0,NaN,12.75

Non ha senso integrare le auto elettriche nelle analisi percheé sono molto poche